label common_2:
    scene bg_black

    $renpy.pause(3.0, hard = True)

    ch_narrator "[ch_boy]이 어머니에게 이끌려 간 곳은 조금 음침하고 어두운 뒷골목에 자리잡은 가게였다."

    ch_narrator "[ch_babyTrader]이라는 간판이 붙어있는 그 곳은 그렇게 크지는 않지만 그렇다고 작지도 않은 건물로, 창문이 거의 없어 내부가 잘 보이지 않았다."
    
    ch_narrator "엄마는 오픈이라는 사인이 걸려있는 문을 열고 울상이 된 [ch_boy]을 가게 안으로 들여보냈다."

    ch_narrator "딸랑 하고 문을 여는 소리가 손님의 출입을 알린다."

    ch_narrator "[ch_boy]과 어머니가 가게로 들어왔지만 영업하는 가게같지 않게 문 쪽을 제외하고는 불 빛이 없어 안쪽은 전혀 보이지 않았다. 두리번 거리던 어머니가 가게 주인을 찾았다."

    ch_mother "저기요, 아기를 팔려고 왔는데요!"

    ch_boy "어... 엄마... 이러지 마세요... 제발... 제발..."

    ch_mother "입 다물고 있어! 젠장 여긴 영업을 하는거야 마는거야?"

    ch_narrator "갑자기 조명이 들어왔다."
    
    ch_narrator "빛이 들어와 시야에 들어온 가게의 내부는 상당히 호화스러운 느낌으로 벽은 고풍스러운 문양의 벽지가 붙어있고 바닥은 나무 목재로 되어있다."
    
    ch_narrator "상당히 비싸보이는 가구들이 먼지 하나 묻어있지 않은 채 여러군데 놓여있어 고급스러운 분위기를 한층 더했다."

    ch_narrator "곧 흥겹고 클래식한 재즈음악이 흘러나오며 무거운 발자국 소리가 건너편에서부터 들려왔다."

    ch_babyTrader "안녕하십니까 레이디, 저의 가게에 잘 오셨습니다. 제가 [ch_babyTrader]입니다. 무엇을 도와드릴까요?"

    ch_narrator "[ch_babyTrader]은 상당한 거구의 남자였다."
    
    ch_narrator "파란색 계통으로 통일 된 높이가 긴 모자와 자켓. 붉은 넥타이, 가슴 주머니의 노란 장미 등 마치 서커스 단장이나 삐에로를 연상시키는 외모였다."
    
    ch_narrator "남자에게는 조금 긴 금발의 머리카락과 턱수염, 풀잎 처럼 얇은 눈, 곰보처럼 거칠고 큰 코와 힘 주어 웃고 있는 것 같은 입꼬리등은 그의 첫인상을 기괴하게 남기고도 남을 것이었다."

    ch_mother "아... 여기 제 아들을 팔고 싶은데요."

    ch_boy "엄마!!!"

    ch_narrator "지금까지 [ch_boy]은 어쩌면 어머니가 단념하고 도중에 집으로 돌아가지 않을까 하는 희망을 가지고 있었다."
    
    ch_narrator "하지만 어머니가 [ch_babyTrader]에게 아들을 판매 하고싶다 밝히자 더이상 그런 일은 일어나지 않는다는 사실을 알았다."

    ch_narrator "[ch_babyTrader]은 남자아이를 지그시 바라보다가 입꼬리만 올리는 웃음을 지으며 물었다."

    ch_babyTrader "잘 생긴 아이구나, 이름이 뭐니?"

    ch_boy "..."

    ch_mother "[ch_main]예요."

    ch_narrator "[ch_boy]이 가만히 있자 어머니가 대신 이름을 말했다."

    ch_babyTrader "[ch_main]라고 하는군요. 이 아이의 어떤 점이 마음에 드시지 않으셨습니까?"

    ch_mother "열등하고 무식한 놈이예요. 제가 먹여 키워봤자 시간 낭비고 보람도 없어요!"
    
    ch_mother "저는 장래에 훌륭한 직업을 가질 아이가 필요해요. 변호사나 판사, 의사처럼요. 그래야 제 체면도 서지 않겠어요?"

    ch_boy "엄마..."

    ch_babyTrader "물론 고객님께는 빛나는 미래가 보장되는 고급 아이가 어울립니다. 잠시 제가 [ch_main]의 재능을 알아보도록 하지요."

    ch_narrator "[ch_babyTrader]는 가슴 안쪽 주머니에서 조그만 기계를 꺼냈다."
    
    ch_narrator "마치 스마트폰 내지는 타블렛처럼 생긴 장치로, 그는 버튼을 눌러 화면을 켜고 그 장치의 뒷면에 달린 센서를 민호에게 가까이 댔다."
    
    ch_narrator "[ch_main]는 눈물을 흘리면서도 그 기계가 신기한지 쳐다보고 있다."

    # beep sound
    ch_narrator "곧 기계에서 신호음이 들려왔다."

    ch_babyTrader "흠 과연..."

    ch_mother "그게 뭐죠?"

    ch_babyTrader "애트리뷰트 체커라는 기계입니다. 아이의 상태나 능력, 재능, 장래에 가질 수 있는 직업 등을 알아보는 유용한 장비지요."
    
    ch_babyTrader "으음... 손님께서 말씀하신 것 처럼 [ch_main]가 그런 직업을 가질 것 같지는 않군요."

    ch_mother "역시 그렇죠? 그럴 줄 알았다니까요. 지금까지 이런 녀석을 키우느라 얼마나 고생한지 생각하면 정말 분통이 터져요!"

    ch_babyTrader "정말 고생 많으셨습니다. 저 [ch_babyTrader]을 방문해주신 것은 정말 탁월한 선택이십니다. 후후훗..."
    
    # beep sound
    ch_babyTrader "최종 결과가 나왔군요. [ch_main]군의 스캔 결과 나이는 5살인 것으로 나오는군요. 아쉽게도 5살이나 되면 많은 값을 쳐 드릴 수는 없습니다."

    ch_babyTrader "이미 자신의 부모에 대한 기억이 확실하기 때문에 새로운 부모님께 정을 붙이기 쉽지 않아 보통 고객님들께서 좋아하지 않으시기 때문이지요."

    ch_mother "그럼 얼마나 쳐줄 수 있지요?"

    # special effect or sound?
    ch_babyTrader "10만원으로 해 드리겠습니다."

    ch_mother "10만원?! 너무 싸잖아요?!"

    ch_babyTrader "손님께서 말씀하신대로 열등한 아이에게 적절한 가격이라고 생각됩니다만."
    
    ch_babyTrader "상기 말씀 드린 것 처럼 [ch_main]군의 나이도 이미 많아 저로서도 관리하기 힘든 입장입니다. 아이가 팔리기 전 까지 제가 관리해야 하기 때문이지요."

    ch_mother "그래도..."

    ch_babyTrader "대신 다른 아기들을 한번 둘러보시는 것은 어떻습니까? 특별히 30\% 할인 해 드리겠습니다."
    
    ch_babyTrader "후후훗... 손님께서 원하실 만한 아이들이 굉장히 많이 있답니다."

    ch_mother "그래요? 앞으로 돈 많이 벌 그런 아이들도 있나요?"
    
    ch_babyTrader "물론입니다 고객님. 부자가 될 아이는 저희 가게의 베스트 셀러지요."

    ch_babyTrader "거기에 효도하는 착한 아이 특성까지 추가하시면... 후후훗 상상만 해도 전율이 느껴지지 않습니까?"

    ch_mother "흠... 그, 그럼 좋아요. 대신 꼭 할인 해주셔야 되요."

    ch_main "엄마!!!"

    ch_mother "미안하구나 [ch_main]야. 이제 작별이야. 엄마한테 맞고 사느라 힘들었지? 나도 네 멍청함을 계속 참고 사느라 힘들었단다."

    ch_mother "이제 새로운 착한 부모를 만나 행복하게 살도록 하렴. 나도 똑똑한 아이를 만나 행복하게 살도록 할게. 그게 우리 둘 모두에게 좋을 것 같구나."

    ch_narrator "[ch_main]는 어머니의 최후 통첩을 듣고 혼이 빠진 마냥 바닥에 주저앉고 말았다."

    ch_babyTrader "그럼 결정되었군요. 감사합니다 고객님."
    
    ch_babyTrader "먼저 [ch_main]를 데려다 놓고 거래 증명서를 가지고 오도록 하겠습니다. 그리고 고객님을 위한 새로운 아이를 보러 가시지요. 잠시만 기다려 주십시오."

    ch_narrator "[ch_babyTrader]은 민호의 어께에 손을 얹으며 위로하듯 말했다."

    ch_babyTrader "[ch_main]군, 이제 어머니와는 작별이구나. 걱정하지 마렴. [ch_main]군에게 맞는 새로운 부모님을 내가 찾아줄테니. 이쪽으로 오려무나."

    ch_narrator "[ch_babyTrader]는 [ch_main]에게 손을 내밀며 유쾌한 삐에로처럼 위 아래 이빨을 보이며 씨익 웃었다."

    ch_main "시... 싫어요..."

    ch_babyTrader "미안하지만 민호 어머니께서 벌써 결정하신 것 같구나. 어떻습니까 어머니?"

    ch_mother "그 지긋지긋한 얼굴을 제 앞에서 빨리 치워주세요!"

    ch_main "......"

    ch_babyTrader "후후훗 그럼 갈까 민호야?"

    jump common_3